Revit 2026 API

# EvaluatedParameter Class

---

Hold the evaluated ParameterValue and Definition of a parameter.

SystemObject Autodesk.Revit.DBEvaluatedParameter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EvaluatedParameter : IDisposable
```
```vb
Public Class EvaluatedParameter
	Implements IDisposable
```
```cpp
public ref class EvaluatedParameter : IDisposable
```
```fsharp
type EvaluatedParameter =
    class
        interface IDisposable
    end
```

The EvaluatedParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Definition | Definition of the parameter. |
|  | HasValue | This property is true when the parameter value was successfully obtained, false otherwise. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StorageType | The storage type describes the type that is used internally within the parameter to store its value. |
|  | Value | Evaluated value of the parameter. |

|  | Name | Description |
| --- | --- | --- |
|  | AsValueString(Document) | Get the parameter value as a string with units. |
|  | AsValueString(Document, FormatOptions) | Get the parameter value as a string with units. |
|  | Dispose | Releases all resources used by the EvaluatedParameter |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace